Tekla.Structures.ModelInternal.dotContour_t
Serialization structure for Contour

Tekla.Structures.ModelInternal.dotContour_t.nContourPoints
How many ContourPoints the Contour has.

Tekla.Structures.ModelInternal.dotContour_t.aX
Array that contains the X coordinates for the ContourPoints

Tekla.Structures.ModelInternal.dotContour_t.aY
Array that contains the Y coordinates for the ContourPoints

Tekla.Structures.ModelInternal.dotContour_t.aZ
Array that contains the Z coordinates for the ContourPoints

Tekla.Structures.ModelInternal.dotContour_t.aChamferType
Array that contains the Chamfer Types for the ContourPoints

Tekla.Structures.ModelInternal.dotContour_t.aChamferX
Array that contains the Chamfer X-Values for the ContourPoints

Tekla.Structures.ModelInternal.dotContour_t.aChamferY
Array that contains the Chamfer Y-Values for the ContourPoints

Tekla.Structures.ModelInternal.dotContour_t.aChamferDZ1
Array that contains the Chamfer DZ1-Values for the ContourPoints

Tekla.Structures.ModelInternal.dotContour_t.aChamferDZ2
Array that contains the Chamfer DZ2-Values for the ContourPoints

Tekla.Structures.ModelInternal.dotContour_t.#ctor(System.Int32)
Constructor
Size: How big we wish the struct to be